Revit 2024 API
DoubleClickTarget Enumeration
 Elements that support double-click in Revit. Note that this is meant to cover cases where the element itself is a double-click target. Individual controls that are targets are handled separately.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Since: 2016
Syntax
C#
public enum DoubleClickTarget
Visual Basic
Public Enumeration DoubleClickTarget
Visual C++
public enum class DoubleClickTarget
Members
Member name | Description
Family |  Family instances
SketchedElement |  Sketch-based elements
ViewOnSheet |  Views on sheets
Assembly |  Assemblies
Group |  Groups
ComponentStairs |  Component-based stairs
OutsideViewOnSheet |  Outside active view on sheet
See Also
Autodesk.Revit.UI Namespace